<!--
/****************************************************************************

所属系统: 组件库
所属模块:  操场-校区选择组件
创建时间: 2020年07月10日 09:56:22
维护人: 叶志
*┌────────────────────────────────────────────────────────────┐
*│  此技术信息为本公司机密信息，未经本公司书面同意禁止向第三方披露．│
*│  版权所有：杰人软件(深圳)有限公司                             │
*└────────────────────────────────────────────────────────────┘
***************************************************************************/
-->
<template>
  <div class="jr-school-choose">
    <jr-school-choose></jr-school-choose>
  </div>
</template>
<script>
export default {
  name: 'schoolChooseView',
  label: "校区操场",
  components: {},
  mixins: [],
  data() {
    return {
    }
  },
  created() { },
  mounted() { },
  methods: {}
}
</script>
<style scoped lang='scss'>
</style>